Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

# newline (NL)
source: \n newline (NL)
es_es: \n nueva línea (NL)

source: A backreference matches whatever actually matched the subpattern in the string being examined, not the rules for that subpattern.
es_es: Una contrareferencia coincide con lo que en realidad coincidía con el subpatrón en la cadena examinada, no con las reglas de ese subpatrón.

source: This used to be a syntax error; a C<< -> >> was required.
es_es: Esto solía ser un error de sintaxis; se requería un C<< -> >>.

source: Filtering is achieved by modifying the contents of C<$_>.
es_es: El filtrado se realiza modificando el contenido de C<$_>.

source: =head1 Installing the built perl on UTS
es_es: =head1 Instalando la compilación de perl en UTS

source: or by using the C<-E> command-line switch in one-liners.
es_es: o mediante el uso de la opción de la línea de comandos C<-E> en los programas Perl de una-línea.

source: The <> symbol will return C<undef> for end-of-file only once.
es_es: El símbolo <> devolverá C<undef> para el fin-de-archivo solo una vez.

source: All functions that are capable of creating filehandles (open(), opendir(), pipe(), socketpair(), sysopen(), socket(), and accept()) automatically create an anonymous filehandle if the handle passed to them is an uninitialized scalar variable.
es_es: Todas las funciones que son capaces de crear identificadores de archivo (open(), opendir(), pipe(), socketpair(), sysopen(), socket(), y accept()) crea automáticamente un identificador de archivo anónimo si el identificador que se les pasa es una variable escalar sin inicializar.

source: If you're new to Perl, you should start by running C<perldoc perlintro>, which is a general intro for beginners and provides some background to help you navigate the rest of Perl's extensive documentation.
es_es: Si nunca ha programado en Perl, debe empezar por ejecutar C<perldoc perlintro> para leer una introducción general para principiantes y aprender a orientarse por la amplia documentación de Perl.

source: It bypasses buffered IO, so mixing this with reads (other than C<sysread())>, C<print>, C<write>, C<seek>, C<tell>, or C<eof> may cause confusion because the perlio and stdio layers usually buffer data.
es_es: Omite E/S con búfer, por lo que mezclar esto con otros tipos de lecturas (distintas de C<sysread()>) como C<print>, C<write>, C<seek>, C<tell>, o C<eof> puede causar confusión porque las capas perlio y stdio, por lo general, usan búfer de datos.

source: To see if you are in this category, issue the command "uname -a".
es_es: Para ver si está en esta categoría, ejecute el comando "uname -a".

source: =head1 Incompatible Changes
es_es: =head1 Incompatibilidades

source: "sendpath" will have internal linkage.
es_es: "sendpath" tendrá un enlazado interno.

source: close OUTPUT # wait for sort to finish
es_es: close OUTPUT # esperar que sort termine

source: The C<\g> and C<\k> notations were introduced in Perl 5.10.0.
es_es: Las notaciones C<\g> y C<\k> fueron introducidas en Perl 5.10.0.

source: I<Operator precedence> means some operators are evaluated before others.
es_es: I<Precedencia de operadores> significa que algunos operadores son evaluados antes que otros.

source: $user_rwx = ($mode & S_IRWXU) >> 6;
es_es: $usuario_rwx = ($modo & S_IRWXU) >> 6;

source: You should not rely on it in security-sensitive situations.> As of this writing, a number of third-party CPAN modules offer random number generators intended by their authors to be cryptographically secure, including: L<Math::Random::Secure>, L<Math::Random::MT::Perl>, and L<Math::TrulyRandom>.
es_es: No debe confiar en él en situaciones delicadas de seguridad.> Al escribir estas líneas, una serie de módulos de CPAN de terceros ofrecen generadores de números aleatorios destinados, por sus autores, a ser criptográficamente seguros, incluyendo L<Math::Random::Secure>, L<Math::Random::MT::Perl>, y L<Math::TrulyRandom>.

source: (This might not seem important, but it is important when you are capturing matched text using parentheses.)
es_es: (Esto puede no parecer importante, pero es importante cuando se está capturando texto usando paréntesis.)

# printf "System returned %d ", $retval;
source: printf "System returned %d\n", $retval;
es_es: printf "Sistema devolvió %d\n", $retval;

source: In that case, it doesn't think the C<...> is the whatever because it's expecting an expression instead of a statement:
es_es: En ese caso, Perl no cree que C<...> es el lo-que-sea porque está esperando una expresión en lugar de una instrucción:

source: If you want a plain text file, try http://www.cpan.org/misc/lwall-quotes.txt.gz .
es_es: Si prefiere un archivo de texto simple, puede descargarlo desde http://www.cpan.org/misc/lwall-quotes.txt.gz .

source: When a match has failed, and unless another verb has been involved in failing the match and has provided its own name to use, the C<$REGERROR> variable will be set to the name of the most recently executed C<(*MARK:NAME)>.
es_es: Cuando una coincidencia ha fallado, y a menos que otro verbo haya estado involucrado en el fallo de la coincidencia y ha dado su propio nombre para ser usado, la variable C<$REGERROR> será ajustada al nombre de C<(*MARK:NOMBRE)> más recientemente ejecutado.

source: by brian d foy
es_es: brian d foy

source: Those features, and the C<feature> pragma itself, have been contributed by Robin Houston.
es_es: Estas características, y el mismo pragma C<feature>, han sido aportados por Robin Houston.

source: You can use a C<;> inside your block to denote that the C<{ ... }> is a block and not a hash reference constructor.
es_es: Puede utilizar un C<;> dentro del bloque para indicar que C<{...}> es un bloque y no un constructor de una referencia a un hash.

source: If a filehandle has been marked as to have an encoding, unmappable characters are detected already during input, not later (when the corrupted data is being used).
es_es: Si un identificador de archivo se ha marcado para tener una cierta codificación, los caracteres no traducibles son detectados en la entrada, no después (cuando los datos dañados se estén utilizando).

source: Similarly, decimal strings can represent only those numbers which have a finite decimal expansion.
es_es: De manera similar, las cadenas decimales solo pueden representar números que tengan una expansión decimal finita.

source: The syntax for most of these is a pair of parentheses with a question mark as the first thing within the parentheses.
es_es: La sintaxis, para la mayor parte de estos casos, es un par de paréntesis con un signo de interrogación como primer elemento dentro de los paréntesis.

source: A hash can be initialized using a literal list holding pairs of items to be interpreted as a key and a value:
es_es: Un hash puede ser inicializado con una lista literal que contenga pares de elementos que deben interpretarse como una clave y un valor:

source: The behaviour of a smart match depends on what type of thing its arguments are.
es_es: El comportamiento de una coincidencia inteligente depende del tipo de cosa que sean sus argumentos.

source: Splits the string EXPR into a list of strings and returns that list.
es_es: Divide la cadena EXPR en una lista de cadenas y devuelve esa lista.

source: $child_pid = open(TO_KID, "|-") // die "can't fork: $!";
es_es: $child_pid = open(AL_HIJO, "|-") // die "no puedo hacer fork: $!";

source: If you use C<unless> in place of C<if>, the sense of the test is reversed.
es_es: Si usa C<unless> en lugar de C<if>, el sentido del test se invierte.

source: Some contexts allow 2 or even 1 digit, but any usage without exactly three digits, the first being a zero, may give unintended results.
es_es: Algunos contextos permiten dos o incluso un dígito, pero cualquier otro uso, sin exactamente tres dígitos, siendo el primero un cero, puede dar resultados inesperados.

source: There is a known race condition opening scripts in C<suidperl>.
es_es: Hay una conocida condición de carrera al abrir scripts con C<suidperl>.

source: (The C<< <=> >> and C<cmp> operators are extremely useful in such routines.) SUBNAME may be a scalar variable name (unsubscripted), in which case the value provides the name of (or a reference to) the actual subroutine to use.
es_es: (Los operadores C<< <=> >> y C<cmp> son muy útiles en este tipo de rutinas). NOMBRE_SUB puede ser el nombre de una variable escalar, en cuyo caso el valor provee el nombre de (o la referencia a) la actual subrutina a usar.

source: =head2 Exceptions in constant folding
es_es: =head2 Excepciones en el plegado de constantes

source: http://www.perl.com/ Perl articles (O'Reilly)
es_es: http://www.perl.com/ artículos sobre Perl (O'Reilly)

source: See the example at C<readdir>.
es_es: Vea el ejemplo en C<readdir>.

source: For the GNU General Public License, see L<perlgpl>.
es_es: Para la Licencia General Pública GNU, vea L<perlgpl>.

source: C<my> creates lexically scoped variables instead.
es_es: En cambio, C<my> crea variables dentro de un ámbito léxico.

source: An OFFSET may be specified to place the read data at some place in the string other than the beginning.
es_es: Un DESPLAZAMIENTO puede ser especificado para colocar los datos leídos en algún otro lugar de la cadena distinto del principio.

source: Be sure to trim your bug down to a tiny but sufficient test case.
es_es: Asegúrese de reducir la aparición del error en un programa que sea pequeño, pero suficiente.

source: While this document is intended to be useful to all module authors, it is particularly aimed at authors who wish to publish their modules on CPAN.
es_es: Aunque este documento está destinado a ser útil a todos los autores de módulos, está especialmente dirigido a autores que desean publicar sus módulos en CPAN.

source: comp.lang.perl.tk Using Tk (and X) from Perl
es_es: comp.lang.perl.tk Uso de Tk (y X) en Perl

source: =head2 F<ext/> reorganisation
es_es: =head2 Reorganización de F<ext/>

source: my $some_condition = 1;
es_es: my $una_condicion = 1;

source: =item recv SOCKET,SCALAR,LENGTH,FLAGS X<recv>
es_es: =item recv SOCKET,ESCALAR,LONGITUD,BANDERAS X<recv>

source: @stripped = map tr/a-zA-Z/ /csr, @original;
es_es: @limpiado = map tr/a-zA-Z/ /csr, @original;

source: In some cases, the use of C<(*PRUNE)> can be replaced with a C<< (?>pattern) >> with no functional difference; however, C<(*PRUNE)> can be used to handle cases that cannot be expressed using a C<< (?>pattern) >> alone.
es_es: En algunos casos, el uso de C<(*PRUNE)> puede ser reemplazado con un C<< (?>patrón) >> sin ninguna diferencia funcional; sin embargo, C<(*PRUNE)> puede ser usado para manejar casos que no pueden ser expresados usando un único C<< (?>patrón) >>.

source: =head2 Hacking toolks and documentation
es_es: =head2 Herramientas y documentación para «hackear»

source: because the main point isn't whether the user typed B<-v> or not.
es_es: porque el objetivo principal no es si el usuario escribió B<-v> o no.

source: This change was done mainly for faster startup times.
es_es: Este cambio se llevó a cabo principalmente por obtener tiempos de arranque más rápidos.

source: =head1 ENVIRONMENT
es_es: =head1 ENTORNO

source: veryCompact => 1, # if you want a bigger dump
es_es: veryCompact => 1, # si quiere un volcado mayor

source: Z A null-terminated (ASCIZ) string, will be null padded.
es_es: Z Una cadena terminada en cero (ASCIZ), será rellenada con nulos.

source: Note that you have can't handle C<readline> errors that way with the C<ARGV> filehandle.
es_es: Note que no puede manejar errores de C<readline> de esta manera con el identificador de archivo C<ARGV>.

source: @contact = sort +find_records(@key);
es_es: @contacto = sort +busca_registros(@claves);

source: Gentler messing with C<Carp::> internals
es_es: Ahora funciona caballerosamente con las funciones internas de C<Carp::>

source: When in slurp mode (C<$/ = undef>) or fixed-length record mode (C<$/> is a reference to an integer or the like; see L<perlvar>) chomp() won't remove anything.
es_es: En modo chupón (C<$/ = undef>) o en modo registros de longitud fija (C<$/> es una referencia a un entero o algo parecido; ver L<perlvar>) chomp() no elimina nada.

source: my $logmessage = shift;
es_es: my $mensaje_registro = shift;

source: by Linchi Shea
es_es: Linchi Shea

source: There are many good books on Perl.
es_es: Se han publicado muchos libros buenos sobre Perl.

source: will allow the user to specify an argument of the form C<"rsh cat file |">, but will not work on a filename that happens to have a trailing space, while
es_es: permitirá al usuario especificar un argumento de la forma C<"rsh cat archivo |">, pero no funcionará en un nombre de archivo que tenga un espacio al final, mientras que

source: Calls the system call specified as the first element of the list, passing the remaining elements as arguments to the system call.
es_es: Llama a la llamada del sistema especificado en el primer elemento de la lista, pasando el resto de elementos como argumentos para la llamada al sistema.

source: For example, it will usually not work across file system boundaries, even though the system I<mv> command sometimes compensates for this.
es_es: Por ejemplo, normalmente no funcionará a través de los límites del sistema de archivos, a pesar de que el comando del sistema I<mv> a veces lo compense.

source: You might notice several familiar Perl concepts in this collection of ACM columns from Jon Bentley.
es_es: Es posible que encuentre varios conceptos de Perl familiares en esta colección de artículos de la ACM escritos por Jon Bentley.

source: SEEK this, position, whence
es_es: SEEK este, posición, desde_donde

source: All the advice contained in this document has been gleaned from extensive conversations with experienced CPAN authors and users.
es_es: Todos los consejos que figuran en este documento ha sido obtenidos de largas conversaciones con autores experimentados CPAN y los usuarios.

source: Certain Perl core C APIs like C<Perl_list> are no longer available without their C<Perl_> prefix.
es_es: Ciertas API C del núcleo de Perl, como C<Perl_list> ya no están disponibles sin su prefijo C<Perl_>.

source: This is for clustering, not capturing; it groups subexpressions like "()", but doesn't make backreferences as "()" does.
es_es: Este es para agrupación, no captura; agrupa subexpresiones como lo hace "()", pero no crea contrareferencias como sí lo hace "()".

source: The current major release of Perl is Perl 5, and was first released in 1994.
es_es: La versión principal actual de Perl es Perl 5, y se lanzó en 1994.

source: The return value for C<atan2(0,0)> is implementation-defined; consult your atan2(3) manpage for more information.
es_es: El valor de retorno para C<atan2(0,0)> depende de la implementación; consulte su página de manual de atan2(3) para más información.

source: Because now an opcode, a basic unit of Perl execution, is never interrupted but instead let to run to completion, certain operations that can take a long time now really do take a long time.
es_es: Porque ahora un código de operación, una unidad básica de ejecución Perl, nunca es interrumpida, sino que va a ejecutarse hasta el final; ciertas operaciones que pueden tomar mucho tiempo ahora realmente se toman un largo tiempo.

source: X<eof> X<end-of-file> X<end of file>
es_es: X<eof> X<end-of-file> X<fin de archivo>

source: $cnt = tr/0-9//; # count the digits in $_
es_es: $cnt = tr/0-9//; # cuenta los dígitos en $_

source: Getting nothing but bug reports can become a bit demoralising: we'll see if this changes things.
es_es: No obtener nada más que informes de error puede ser algo desmoralizante: veremos si esto cambia las cosas.

source: The intent of this document is to state the conditions under which a Package may be copied, such that the Copyright Holder maintains some semblance of artistic control over the development of the package, while giving the users of the package the right to use and distribute the Package in a more-or-less customary fashion, plus the right to make reasonable modifications.
es_es: La intención de este documento es establecer las condiciones en que un Paquete puede ser copiado, de manera que el Titular del Copyright mantiene una apariencia de control artístico sobre el desarrollo del paquete, mientras que dan a los usuarios del paquete el derecho a utilizar y distribuir el Paquete de una manera que sea más o menos habitual, además del derecho a hacer modificaciones razonables.

source: open(EXTRACT, "|sort >Tmp$$") # $$ is our process id
es_es: open(EXTRACT, "|sort >Tmp$$") # $$ es nuestro proceso id

source: If EXPR is not present, C<$_> is checked.
es_es: Si EXPR no está presente, se comprobará C<$_>.

source: C<vec> may also be assigned to, in which case parentheses are needed to give the expression the correct precedence as in
es_es: C<vec> también puede ser asignado, en cuyo caso los paréntesis son necesarios para dar a la expresión la correcta precedencia, como en

source: The value returned is either the empty string for false, or a sequence number (beginning with 1) for true.
es_es: El valor devuelto es una cadena vacía para falso, o un número de secuencia (empezando por 1) para verdadero.

source: The returned value is the amount of time remaining on the previous timer.
es_es: El valor devuelto es la cantidad de tiempo restante del temporizador anterior.

source: See L<perlipc/"Signals"> for more details.
es_es: Ver L<perlipc/"Señales"> para más detalles.

source: Also remember that "|" is interpreted as a literal within square brackets, so if you write C<[fee|fie|foe]> you're really only matching C<[feio|]>.
es_es: También recuerde que "|" es interpretado como un literal cuando está entre corchetes, por lo que si usted escribe C<[fee|fie|foe]> realmente está solo buscando C<[feio|]>.

source: Note that, unlike C and Pascal, these are defined in terms of BLOCKs, not statements.
es_es: Note que, a diferencia del C y Pascal, están definidas en términos de BLOQUES, no instrucciones.

source: If you run Perl with the B<-w> switch it can warn you about this.
es_es: Si ejecuta Perl con la opción B<-w> le avisará sobre todo esto.

source: Even if all platforms are using IEEE, there may still be subtle differences.
es_es: Incluso si todas las plataformas usan IEEE, todavía puede haber diferencias sutiles.

source: The L<crypt|/crypt> function is unsuitable for hashing large quantities of data, not least of all because you can't get the information back.
es_es: La función L<crypt|/crypt> no es apropiada para calcular el hash de grandes volúmenes de información, teniendo en cuenta que no es posible luego volver a obtener la misma información.

source: Any CodeRef scalar sub truth $b->($a)
es_es: Cualquiera RefCódigo escalar sub verdad $b->($a)

source: Earlier versions of the strict pragma did not check the parameters implicitly passed to its "import" (use) and "unimport" (no) routine.
es_es: Las versiones anteriores del pragma strict no comprobaban de forma implícita los parámetros pasados a sus rutinas "import" (use) y "unimport" (no).

source: Provides Windows Vista support to C<Win32::GetOSName>
es_es: Proporciona soporte para C<Win32::GetOSName> en Windows Vista

source: The C<sort> pragma is now lexically scoped.
es_es: El pragma C<sort> tiene ahora un alcance léxico.

source: =head1 AVAILABILITY
es_es: =head1 DISPONIBILIDAD

source: # force use of mergesort (not portable outside Perl 5.8)
es_es: # fuerza el uso del mergesort (no portátil fuera de Perl v5.8)

source: < less than
es_es: < menor que

source: The final element of a list assignment may be an array or a hash:
es_es: El elemento final de una asignación de lista puede ser un array o un hash:

source: =item rename OLDNAME,NEWNAME X<rename> X<move> X<mv> X<ren>
es_es: =item rename NOMBRE_VIEJO,NOMBRE_NUEVO X<rename> X<move> X<mv> X<ren> X<mover> X<renombra>

source: (?^:pattern)
es_es: (?^:patrón)

source: You can refer to this document in Pod via "L<perlartistic>"
es_es: Puede hacer referencia a este documento en Pod a través de "L<perlartistic>"

source: B<Unicode> is a character set with room for lots of characters.
es_es: B<Unicode> es un juego de caracteres en el que caben muchos caracteres.

source: Until that is done, those modules should be in F<cpan/>.
es_es: Mientras no se determine, estos módulos deben estar en F<cpan/>.

source: Binary ">" returns true if the left argument is numerically greater than the right argument.
es_es: Binario ">" devuelve verdadero si el argumento de la izquierda es numéricamente mayor que el argumento de la derecha.

source: To encode, you have to supply the target encoding, for example C<iso-8859-1> or C<UTF-8>.
es_es: Al codificar debe especificar la codificación de destino (por ejemplo, C<iso-8859-1> o C<UTF-8>).

source: Note that this filehandle must be a real filehandle (strictly a typeglob or reference to a typeglob, whether blessed or unblessed); tied filehandles will be ignored and processing will stop there.
es_es: Tenga en cuenta que este identificador de archivo debe ser un identificador de archivo real (en sentido estricto un C<typeglob> o una referencia a un C<typeglob>, bendecido o no); identificadores de archivo enlazados serán ignorados y el procesado terminará ahí.

source: This feature has been fixed and is also documented better.
es_es: Esta característica se ha fijado y está también mejor documentada.

source: Until then, the use of sysopen(), sysread() and syswrite() is not supported for "text" mode operations.
es_es: Hasta entonces, el uso de sysopen(), sysread() y syswrite() no está soportado para las operaciones en modo "texto".

source: You may mail your bug reports (be sure to include full configuration information as output by the myconfig program in the perl source tree, or by C<perl -V>) to perlbug@perl.org . If you've succeeded in compiling perl, the L<perlbug> script in the F<utils/> subdirectory can be used to help mail in a bug report.
es_es: Puede enviar sus informes de errores (asegúrese de incluir la información de configuración completa, como la salida del programa myconfig, en el árbol de código fuente Perl, o con C<perl -V>) a perlbug@perl.org. Si ha tenido éxito compilando Perl, el script L<perlbug> en el subdirectorio F<utils/> se puede utilizar para enviar por correo electrónico un informe de los errores encontrados.

source: It's also cheaper not to capture characters if you don't need to.
es_es: También, es más barato no capturar caracteres si no son necesarios.

source: except that it's more efficient and concise, keeps track of the current filename for error messages, searches the C<@INC> directories, and updates C<%INC> if the file is found.
es_es: excepto que es más eficiente y conciso, mantiene el nombre del archivo en los mensajes de error, busca en los directorios C<@INC> y actualiza C<%INC> si el archivo es encontrado.

source: Being able to use C<< > >> or C<< < >> on floating-point values can be useful, but also dangerous if you don't know exactly what you're doing.
es_es: El ser capaz de usar C<< > >> o C<< < >> en valores de punto flotante puede ser útil, pero también peligroso si no sabe exactamente lo que está haciendo.

source: Modules not available from CPAN
es_es: Módulos no disponibles en CPAN

source: =item vec EXPR,OFFSET,BITS X<vec> X<bit> X<bit vector>
es_es: =item vec EXPR,DESPLAZAMIENTO,BITS X<vec> X<bit> X<bit vector> X<vectores de bit>

source: The size specifier C<V> has no effect for Perl code, but is supported for compatibility with XS code.
es_es: La especificación de tamaño C<V> no tiene ningún efecto en el código Perl, pero se admite para la compatibilidad con el código XS.

source: Install all perl files:
es_es: Instalar todos los archivos de perl:
